app/controllers/records_controller.rb

SELECT "records".* FROM "records" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "records"
---
     def index
        @records = Record.all.page(params[:page])

INSERT INTO "records" ("company_name", "email_id", "company_code", "strength", "website", "created_at", "updated_at") VALUES ('', '', '', NULL, '', '2025-01-24 15:55:12.762829', '2025-01-24 15:55:12.762829') RETURNING "id"
---
     def create
       @record = Record.create(records_params)

SELECT "records".* FROM "records" WHERE "records"."id" = 2 LIMIT 1
---
     def show
      @record = Record.find(params[:id])

SELECT "records".* FROM "records" WHERE "records"."id" = 1 LIMIT 1
---
     def edit
        @record = Record.find(params[:id])

SELECT "records".* FROM "records" WHERE "records"."id" = 2 LIMIT 1
---
     def update
         @record = Record.find(params[:id])

SELECT "records".* FROM "records" WHERE "records"."id" = 1 LIMIT 1
DELETE FROM "records" WHERE "records"."id" = 1
---
     def destroy
      @record = Record.find(params[:id])
      @record.destroy